# Intro a Pandas

Pandas es una librería de Python que nos permite trabajar con datos tabulares de manera muy eficiente. 

En el mundo del análisis de datos, Pandas se ha convertido en una herramienta fundamental para científicos de datos, analistas y cualquier persona que trabaje con datos en Python. Con Pandas, puedes realizar operaciones como limpieza, manipulación, visualización y análisis de datos de manera eficiente.

![](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1920px-Pandas_logo.svg.png)

## 1. Instalar Pandas

Para instalar Pandas, ejecuta el siguiente comando en tu terminal:

```bash
pip install pandas==<version>
```

## 2. Series y Dataframes

Pandas tiene dos estructuras de datos principales: Series y DataFrames.

- **Series**: es un array unidimensional. Es similar a una columna en una tabla de Excel.
- **DataFrame**: es una estructura de datos bidimensional con filas y columnas con etiquetas. Es similar a una tabla de Excel.

### 2.1 Series

Para crear una Serie, puedes pasar una lista de elementos y Pandas creará una Serie con índices numéricos.

In [2]:
import pandas as pd

In [3]:
import numpy as np
serie = pd.Series([1, 2, 3, 4, 5])
serie

0    1
1    2
2    3
3    4
4    5
dtype: int64

### 2.2 DataFrames

Para crear un DataFrame, puedes pasar un diccionario de listas, donde cada clave es el nombre de la columna y cada valor es una lista de elementos.

In [5]:
data = {
    'name': ['María', 'Daniel', 'Marisa', 'David', 'Sabrina'],
    'age': [16, 7, 29, None, 33], 
    'city': ['Madrid', 'Madrid', 'Málaga', 'Málaga', 'Valladolid'],
    'height': [None, 1.20, 1.60, 2.01, 1.83]
}

df = pd.DataFrame(data)
df

      name   age        city  height
0    María  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      Málaga    1.60
3    David   NaN      Málaga    2.01
4  Sabrina  33.0  Valladolid    1.83

Aunque lo más normal es crear DataFrames a partir de archivos CSV, Excel, bases de datos, etc. En este caso, vamos a guardar el DataFrame en un archivo CSV y posteriormente lo leeremos.

In [6]:
CSV_PATH = 'data.csv'

df.to_csv(CSV_PATH, index=False)

In [7]:
df = pd.read_csv(CSV_PATH)
df

      name   age        city  height
0    María  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      Málaga    1.60
3    David   NaN      Málaga    2.01
4  Sabrina  33.0  Valladolid    1.83

## 3. Basics de un Dataframe

Podemos visualizar los primeros/últimos registros de un DataFrame con los métodos `head()` y `tail()`, respectivamente.

In [6]:
df.head(3)

     name   age    city  height
0   María  16.0  Madrid     NaN
1  Daniel   7.0  Madrid     1.2
2  Marisa  29.0  Málaga     1.6

In [8]:
df.tail(4)

      name   age        city  height
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      Málaga    1.60
3    David   NaN      Málaga    2.01
4  Sabrina  33.0  Valladolid    1.83

Los dataframes tienen una serie de atributos básicos: `.columns`, `.values`, `.shape`, `.dtypes`, etc. Algunos de ellos te recordarán a los atributos de un array de NumPy.

In [9]:
df.columns

Index(['name', 'age', 'city', 'height'], dtype='object')

In [10]:
df.values

array([['María', 16.0, 'Madrid', nan],
       ['Daniel', 7.0, 'Madrid', 1.2],
       ['Marisa', 29.0, 'Málaga', 1.6],
       ['David', nan, 'Málaga', 2.01],
       ['Sabrina', 33.0, 'Valladolid', 1.83]], dtype=object)

In [11]:
df.shape

(5, 4)

In [12]:
df.dtypes

name       object
age       float64
city       object
height    float64
dtype: object

## 4. Estadísticas básicas

Pandas nos permite obtener la información general de un Dataframe con el método `info()`.

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     4 non-null      float64
 2   city    5 non-null      object
 3   height  4 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes



Pandas nos permite obtener estadísticas básicas de un DataFrame con el método `describe()`. Este método nos devuelve un resumen de las estadísticas descriptivas de las **columnas numéricas**.

In [14]:
df.describe()

             age    height
count   4.000000  4.000000
mean   21.250000  1.660000
std    11.954776  0.349571
min     7.000000  1.200000
25%    13.750000  1.500000
50%    22.500000  1.715000
75%    30.000000  1.875000
max    33.000000  2.010000

## 5. Indexación

Recordemos que el indexing consiste en seleccionar un subconjunto de datos de un DataFrame. Recordemos antes cómo era el dataframe original y veamos que Pandas nos permite indexar un DataFrame de diferentes maneras.

In [15]:
df

      name   age        city  height
0    María  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      Málaga    1.60
3    David   NaN      Málaga    2.01
4  Sabrina  33.0  Valladolid    1.83


**Por nombre de columna**: `df['column_name']`

In [16]:
df[["name", "age"]]

      name   age
0    María  16.0
1   Daniel   7.0
2   Marisa  29.0
3    David   NaN
4  Sabrina  33.0

**Por posición (índice) de la fila**: `df.iloc[0]`

In [17]:
df.iloc[1:4]

     name   age    city  height
1  Daniel   7.0  Madrid    1.20
2  Marisa  29.0  Málaga    1.60
3   David   NaN  Málaga    2.01

In [18]:
df.set_index('age')

         name        city  height
age
16.0    María      Madrid     NaN
7.0    Daniel      Madrid    1.20
29.0   Marisa      Málaga    1.60
NaN     David      Málaga    2.01
33.0  Sabrina  Valladolid    1.83

**Por etiqueta de la fila**: `df.loc['row_label']`

In [19]:
df.loc[1]  # en este caso, como los indices son los mismos que las posiciones, `loc` es lo mismo que `iloc`

name      Daniel
age          7.0
city      Madrid
height       1.2
Name: 1, dtype: object

**Por etiqueta de fila y columna**: `df.loc['row_label', 'column_name']`

In [20]:
df.loc[0, 'name']

'María'

**Por condición**: `df[df['column_name'] > 0]`

In [21]:
condition = df['age'] > 18
df[condition]  # así se filtran los datos

      name   age        city  height
2   Marisa  29.0      Málaga    1.60
4  Sabrina  33.0  Valladolid    1.83

**Por valores mínimos y máximos**: `df['column_name'].idxmin()` y `df['column_name'].idxmax()`

In [22]:
max_age_row_idx = df["age"].idxmax()
max_age_row = df.loc[max_age_row_idx]
max_age_row

name         Sabrina
age             33.0
city      Valladolid
height          1.83
Name: 4, dtype: object

## 6. Data Cleaning

El data cleaning es un paso fundamental en cualquier análisis de datos. Pandas nos permite realizar operaciones de limpieza de datos de manera muy eficiente. **Es muy común encontrarnos con valores nulos** en nuestros datasets. Pandas nos ofrece métodos para tratar estos valores nulos, como `dropna()`, `fillna()` y `isnull()`. Recordemos primero, el dataset original.

In [23]:
df

      name   age        city  height
0    María  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      Málaga    1.60
3    David   NaN      Málaga    2.01
4  Sabrina  33.0  Valladolid    1.83

Por ejemplo, para ver si hay valores nulos en un DataFrame, podemos usar los metodos `isnull()` ó `isna()`.

In [24]:
df.isnull()

    name    age   city  height
0  False  False  False    True
1  False  False  False   False
2  False  False  False   False
3  False   True  False   False
4  False  False  False   False

Para **eliminar** las filas con valores nulos, podemos usar el método `dropna()`.

In [25]:
df.dropna()

      name   age        city  height
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      Málaga    1.60
4  Sabrina  33.0  Valladolid    1.83

Para **rellenar** los valores nulos con un valor específico, podemos usar el método `fillna()`.

In [26]:
df.fillna(0)  # rellena los valores nulos con 0

      name   age        city  height
0    María  16.0      Madrid    0.00
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      Málaga    1.60
3    David   0.0      Málaga    2.01
4  Sabrina  33.0  Valladolid    1.83

Estos métodos son aplicables también a las Series (columnas de un DataFrame).

In [27]:
df['age'].fillna(10)

0    16.0
1     7.0
2    29.0
3    10.0
4    33.0
Name: age, dtype: float64

# Ejercicios

Toma el dataframe original y guárdalo como un CSV

In [28]:
df.to_csv

<bound method NDFrame.to_csv of       name   age        city  height
0    María  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      Málaga    1.60
3    David   NaN      Málaga    2.01
4  Sabrina  33.0  Valladolid    1.83>

Ahora lee el archivo CSV

In [29]:
pd.read_csv
df

      name   age        city  height
0    María  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      Málaga    1.60
3    David   NaN      Málaga    2.01
4  Sabrina  33.0  Valladolid    1.83

Muestra los 3 primeros registros del DataFrame.

In [30]:
df.head(3)

     name   age    city  height
0   María  16.0  Madrid     NaN
1  Daniel   7.0  Madrid     1.2
2  Marisa  29.0  Málaga     1.6

Muestra los 4 últimos registros del DataFrame.

In [31]:
df.tail(4)

      name   age        city  height
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      Málaga    1.60
3    David   NaN      Málaga    2.01
4  Sabrina  33.0  Valladolid    1.83

Dime cuantos datos tiene el DataFrame (💡 es lo mismo que calcular el número de filas). ¿en `numpy` vimos 2 formas de calcular este dato, recuerdas?

In [32]:
df.shape

(5, 4)

In [33]:
len(df)

5

Muéstrame las estadísticas básicas del DataFrame.

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     4 non-null      float64
 2   city    5 non-null      object
 3   height  4 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

In [35]:
df.describe()

             age    height
count   4.000000  4.000000
mean   21.250000  1.660000
std    11.954776  0.349571
min     7.000000  1.200000
25%    13.750000  1.500000
50%    22.500000  1.715000
75%    30.000000  1.875000
max    33.000000  2.010000

In [36]:
df = pd.DataFrame(data)
df

      name   age        city  height
0    María  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      Málaga    1.60
3    David   NaN      Málaga    2.01
4  Sabrina  33.0  Valladolid    1.83

Obtén los datos de la columna 'name' ¿Cual es el tipo de dato de esta columna?

In [37]:
df["name"]

0      María
1     Daniel
2     Marisa
3      David
4    Sabrina
Name: name, dtype: object

🌶️ Recuera que una Serie se puede tratar como un array de numpy, por tanto, obtén los datos de la columna "age" y calcula la media. ¿Coincide con el resultado que arroja pandas en la celda superior? (💡 en `numpy` la media se calcula usando `np.mean`)

In [38]:
df["age"].mean()

np.float64(21.25)

Ahora calcula la edad máxima y mínima de la columna "age".

In [39]:
df["age"].max()

np.float64(33.0)

In [40]:
df["age"].min()

np.float64(7.0)

🌶️ Una vez obtenida la edad mínima, ¿Cual es el nombre de dicha persona?

In [41]:
min_age = df["age"].min()
mask = df["age"] == min_age
df[mask]["name"].iloc[0]

'Daniel'

Filtra el DataFrame: muestra las filas donde la edad sea mayor a 25.

In [42]:
mask = df["age"] > 25
df[mask]

      name   age        city  height
2   Marisa  29.0      Málaga    1.60
4  Sabrina  33.0  Valladolid    1.83

Filtra el DataFrame: muestra las filas donde la gente sea de 'Málaga'. (💡 utiliza el operador `==`)

In [49]:
mask = df["city"] == "Málaga"
df[mask]

     name   age    city  height
2  Marisa  29.0  Málaga    1.60
3   David   NaN  Málaga    2.01

🌶️ Filtra el Dataframe: filas donde la gente sea de 'Málaga' y mayor de 25. (💡 para sumar dos condiciones se utiliza el operador `and` que se representa en python con `&`, i.e.: 

```python
compose_condition = condition1 & condition2
```

In [43]:
mask = df[["city"] == "Málaga"] & [df["age"] > 25]
df[mask]

KeyError: False

Obtén la máscara de los valores que son nulos en el DataFrame.

In [44]:
df.isnull()

    name    age   city  height
0  False  False  False    True
1  False  False  False   False
2  False  False  False   False
3  False   True  False   False
4  False  False  False   False

Ahora obtén la máscara de los valores que NO son nulos en el DataFrame. (💡 busca en la documentación de pandas, o en google, cómo hacerlo)

In [45]:
~df.isnull()

   name    age  city  height
0  True   True  True   False
1  True   True  True    True
2  True   True  True    True
3  True  False  True    True
4  True   True  True    True

Elimina los valores nulos del DataFrame.

In [46]:
df.dropna()

      name   age        city  height
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      Málaga    1.60
4  Sabrina  33.0  Valladolid    1.83

Rellena todos los valores nulos con 1.

Ahora rellena sólo los valores nulos de la columna 'age' con 10.

🌶️ Ahora rellena los valores nulos de la columna 'height' con la media de dicha columna

## BONUS: Explora los datos del dataset de Titanic

El dataset de Titanic es un dataset muy famoso en el mundo del análisis de datos. Contiene información sobre los pasajeros del Titanic, incluyendo si sobrevivieron o no, su edad, sexo, clase, etc.

In [47]:
CSV_PATH = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"

df = pd.read_csv(CSV_PATH)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Hazte preguntas como, ¿Qué porcentaje de pasajeros sobrevivió? ¿Cuál es la edad media de los pasajeros? ¿Cuántos pasajeros había en cada clase? ¿Cuál es la edad media de los pasajeros que sobrevivieron y de los que no? ¿Cuál es la edad máxima de los pasajeros que sobrevivieron y de los que no?